#include<stdio.h>

int main(){
    // 整数表示虽然只能编码较小的范围，但它是精确的
    int i = 200*300*400*500;
    printf("(int) 200*300*400*500 = %d\n", i); 
    i = (500*400)*(300*200);
    printf("(int) (500*400)*(300*200) = %d\n", i);
    i = ((500*400)*300)*200;
    printf("(int) ((500*400)*300)*200 = %d\n", i);
    i = 400*(200*(300*500));
    printf("(int) 400*(200*(300*500)) = %d\n", i);
    // 浮点表示能够编码较大的范围，但它是近似的
    float f = (3.14+1e20)-1e20;
    printf("(float) (3.14+1e20)-1e20 = %f\n", f);
    f = 3.14+(1e20-1e20);
    printf("(float) 3.14+(1e20-1e20) = %f\n", f);
    return 0; 
}